{
    "Number": 157,
    "Name": "Typhlosion Hisui",
    "Alter Ego": "Typhlosion",
    "Type": "Fire/Ghost",
    "Stamina": 6,
    "Movement": "L",
    "Size": 3,
    "Threat Level": 4,
    "Weak Type": "water",
    "Resistant Type": "grass",
    "Weak Defense": 3,
    "Defense": 5,
    "Resistant Defense": 6,
    "Attacks": [
      {
        "Name": "Infernal Parade",
        "Type": "mystic",
        "Poke Type": "ghost",
        "Range": 4,
        "Strength": 6,
        "Power Cost": 0,
        "Effect": "After this attack is resolved, this character gains power equal to the damage dealt. If a wild is rolled, the target character gains the Burn special condition and suffers 1 additional damage at the start of their next activation."
      },
      {
        "Name": "Shadow Ball",
        "Type": "mystic",
        "Poke Type": "ghost",
        "Range": 3,
        "Strength": 6,
        "Power Cost": 1,
        "Effect": "After this attack is resolved, this character gains power equal to the damage dealt. If a wild is rolled, reduce the target character's Defense by 1 until the end of their next activation."
      },
      {
        "Name": "Flamethrower",
        "Type": "energy",
        "Poke Type": "fire",
        "Range": 4,
        "Strength": 6,
        "Power Cost": 2,
        "Effect": "After this attack is resolved, this character gains power equal to the damage dealt. If a wild is rolled, the target character gains the Burn special condition."
      },
      {
        "Name": "Hex",
        "Type": "mystic",
        "Poke Type": "ghost",
        "Range": 3,
        "Strength": 7,
        "Power Cost": 3,
        "Effect": "If the target character has a special condition, add 2 dice to the attack roll. If a wild is rolled, the target character gains the Stun special condition."
      }
    ],
    "Superpowers": [
     {
        "Name": "Frisk",
        "Type": "innate",
        "Cost": 0,
        "Range": 0,
        "Effect": "When this character makes an attack, if a wild is rolled, this character gains 1 power."
     },
     {
        "Name": "Flame Cloak",
        "Type": "innate",
        "Cost": 0,
        "Range": 0,
        "Effect": "This character gains immunity to the Burn special condition. Additionally, enemy characters that make melee attacks against this character gain the Burn special condition."
     },
     {
        "Name": "Phantom Flames",
        "Type": "active",
        "Cost": 3,
        "Range": 3,
        "Effect": "Choose an enemy character within range and line of sight. That character suffers 2 damage and gains both the Burn and Stun special conditions. This superpower can be used only once per turn."
     }
    ],
    "Injured Side": {
      "Stamina": 5,
      "Attacks": [
        {
          "Name": "Infernal Parade",
          "Type": "mystic",
          "Poke Type": "ghost",
          "Range": 4,
          "Strength": 8,
          "Power Cost": 2,
          "Effect": "This attack deals damage to all characters (friend and foe) within range 2 of the target character. All affected characters gain the Burn special condition. If a wild is rolled, affected characters also gain the Stun special condition."
        }
      ],
      "Superpowers": [
        {
           "Name": "Cursed Flames",
           "Type": "active",
           "Cost": 4,
           "Range": 4,
           "Effect": "All enemy characters within range and line of sight suffer 2 damage and gain the Burn special condition. Additionally, they lose 2 power. This superpower can be used only once per game."
        },
        {
           "Name": "Frisk",
           "Type": "innate",
           "Cost": 0,
           "Range": 0,
           "Effect": "When this character makes an attack, if a wild is rolled, this character gains 1 power."
        }
      ]
    }
}

